historic/m2.x4large/mixed-01-5g.fio.out
randread-1k: (g=0): rw=randread, bs=1K-1K/1K-1K/1K-1K, ioengine=libaio, iodepth=10
seqread: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
seqwrite: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
fio-2.1.4
Starting 3 processes

randread-1k: (groupid=0, jobs=1): err= 0: pid=2047: Sat Mar 15 04:03:05 2014
  read : io=4711.0KB, bw=80372B/s, iops=78, runt= 60021msec
    slat (usec): min=3, max=127896, avg=12729.24, stdev=19293.81
    clat (usec): min=5, max=474015, avg=114588.24, stdev=71883.43
     lat (usec): min=57, max=492986, avg=127317.80, stdev=77220.72
    clat percentiles (usec):
     |  1.00th=[   54],  5.00th=[   56], 10.00th=[22912], 20.00th=[48896],
     | 30.00th=[75264], 40.00th=[94720], 50.00th=[111104], 60.00th=[128512],
     | 70.00th=[150528], 80.00th=[175104], 90.00th=[205824], 95.00th=[226304],
     | 99.00th=[329728], 99.50th=[374784], 99.90th=[415744], 99.95th=[464896],
     | 99.99th=[473088]
    bw (KB  /s): min=   29, max=  189, per=0.50%, avg=77.30, stdev=33.48
    lat (usec) : 10=0.02%, 100=8.47%
    lat (msec) : 10=0.76%, 20=0.15%, 50=10.80%, 100=23.90%, 250=53.30%
    lat (msec) : 500=2.59%
  cpu          : usr=0.03%, sys=0.16%, ctx=1897, majf=0, minf=28
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=99.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=4711/w=0/d=0, short=r=0/w=0/d=0
seqread: (groupid=0, jobs=1): err= 0: pid=2048: Sat Mar 15 04:03:05 2014
  read : io=922624KB, bw=15354KB/s, iops=14, runt= 60090msec
    slat (usec): min=849, max=233861, avg=66661.54, stdev=40239.63
    clat (usec): min=6, max=1616.9K, avg=599896.64, stdev=336093.93
     lat (msec): min=17, max=1752, avg=666.56, stdev=371.94
    clat percentiles (msec):
     |  1.00th=[  153],  5.00th=[  420], 10.00th=[  424], 20.00th=[  441],
     | 30.00th=[  453], 40.00th=[  457], 50.00th=[  461], 60.00th=[  469],
     | 70.00th=[  478], 80.00th=[  490], 90.00th=[ 1254], 95.00th=[ 1385],
     | 99.00th=[ 1549], 99.50th=[ 1582], 99.90th=[ 1614], 99.95th=[ 1614],
     | 99.99th=[ 1614]
    bw (KB  /s): min= 4954, max=32000, per=100.00%, avg=15523.74, stdev=6618.30
    lat (usec) : 10=0.11%
    lat (msec) : 20=0.67%, 100=0.11%, 250=0.55%, 500=80.02%, 750=0.78%
    lat (msec) : 1000=0.67%, 2000=17.09%
  cpu          : usr=0.03%, sys=1.23%, ctx=12021, majf=0, minf=2588
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=99.2%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=901/w=0/d=0, short=r=0/w=0/d=0
seqwrite: (groupid=0, jobs=1): err= 0: pid=2049: Sat Mar 15 04:03:05 2014
  write: io=922624KB, bw=15354KB/s, iops=14, runt= 60092msec
    slat (usec): min=928, max=269560, avg=66665.62, stdev=40860.47
    clat (usec): min=6, max=1616.1K, avg=599935.54, stdev=336202.56
     lat (msec): min=16, max=1766, avg=666.60, stdev=372.05
    clat percentiles (msec):
     |  1.00th=[  155],  5.00th=[  420], 10.00th=[  424], 20.00th=[  441],
     | 30.00th=[  453], 40.00th=[  457], 50.00th=[  461], 60.00th=[  469],
     | 70.00th=[  478], 80.00th=[  490], 90.00th=[ 1254], 95.00th=[ 1385],
     | 99.00th=[ 1549], 99.50th=[ 1582], 99.90th=[ 1614], 99.95th=[ 1614],
     | 99.99th=[ 1614]
    bw (KB  /s): min= 4954, max=32062, per=100.00%, avg=15514.49, stdev=6630.48
    lat (usec) : 10=0.11%
    lat (msec) : 20=0.67%, 100=0.11%, 250=0.55%, 500=80.13%, 750=0.67%
    lat (msec) : 1000=0.67%, 2000=17.09%
  cpu          : usr=0.55%, sys=0.88%, ctx=12032, majf=0, minf=28
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=99.2%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=901/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=927335KB, aggrb=15432KB/s, minb=78KB/s, maxb=15354KB/s, mint=60021msec, maxt=60090msec
  WRITE: io=922624KB, aggrb=15353KB/s, minb=15353KB/s, maxb=15353KB/s, mint=60092msec, maxt=60092msec

Disk stats (read/write):
  xvdf: ios=24136/7410, merge=13/75178, ticks=708671/3298081, in_queue=4039454, util=99.51%